{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v1.7.2", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["input_3", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"name": "dense2", "class_name": "Dense", "config": {"name": "dense2", "trainable": true, "dtype": "float32", "units": 216, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "dense3", "class_name": "Dense", "config": {"name": "dense3", "trainable": true, "dtype": "float32", "units": 216, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense2", 0, 0, {}]]]}, {"name": "dense4", "class_name": "Dense", "config": {"name": "dense4", "trainable": true, "dtype": "float32", "units": 216, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense3", 0, 0, {}]]]}, {"name": "dense8", "class_name": "Dense", "config": {"name": "dense8", "trainable": true, "dtype": "float32", "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense4", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense8", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense2/kernel", "shape": [11, 216], "dtype": "float32"}, {"name": "dense2/bias", "shape": [216], "dtype": "float32"}, {"name": "dense3/kernel", "shape": [216, 216], "dtype": "float32"}, {"name": "dense3/bias", "shape": [216], "dtype": "float32"}, {"name": "dense4/kernel", "shape": [216, 216], "dtype": "float32"}, {"name": "dense4/bias", "shape": [216], "dtype": "float32"}, {"name": "dense8/kernel", "shape": [216, 3], "dtype": "float32"}, {"name": "dense8/bias", "shape": [3], "dtype": "float32"}]}]}